{"name":"a-o.dev","headerTaglineOne":"Hey 👋","headerTaglineTwo":"I'm Andi -","headerTaglineThree":"developer and creator","headerTaglineFour":" based in Austria.","showCursor":false,"showBlog":false,"darkMode":false,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/AndreasOA"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/andreas-oberdammer/"},{"id":"3","title":"Twitter","link":"https://twitter.com/heyandio"},{"id":"5","title":"Email","link":"mailto:andreas.oberdammer+social@gmail.com"}],"projects":[{"id":"1","title":"Thermal Image Person Detection","description":"Our project utilizes YOLOv5, an advanced object detection algorithm, to locate humans in thermal videos captured by a drone equipped with a thermal camera. By analyzing thermal imagery, we can easily detect human presence in various environments and conditions, even in complete darkness. This technology has significant applications in search and rescue operations, border patrol, and security monitoring. Our system offers a high level of accuracy and can analyze video in real-time, allowing for quick and effective response to potential threats. Whether used for public safety or military operations, our YOLOv5 human detection system can provide critical information that can help save lives and ensure security.","imageSrc":"https://public-files.gumroad.com/vl10vhq81zqu0gcjgekqlkr88kw9","url":""},{"id":"2","title":"Car wallpaper set for mobile phones #01","description":"Introducing my newest creation - a stunning wallpaper set designed specifically for mobile devices. This set features seven high-quality images of four of the most iconic and sought-after cars in the automotive industry: the BMW M3 Touring, BMW M4 CSL, Apollo IE, and Nissan GTR R34, all of which have been photographed by me.  Each image has been carefully crafted to showcase the sleek lines and unique features of each car, making it the perfect addition to any car enthusiast's collection. Whether you're a fan of sports cars or simply appreciate great photography, this wallpaper set is sure to impress.  With a focus on clarity, color, and composition, these wallpapers are optimized for mobile devices and will look stunning on any screen.","imageSrc":"https://public-files.gumroad.com/5loh5xdadnprduksz0wmp8q9e1e1","url":"https://heyandio.gumroad.com/l/wallpapperset1"},{"id":"3","title":"Recyclify - React App","description":"Introducing Recyclify - the ultimate app for all your recycling needs! With Recyclify, you can easily find recycling recommendations in your area based on your current location. Whether you're looking to recycle old electronics or dispose of hazardous materials safely, Recyclify has got you covered.  But that's not all - Recyclify is also a marketplace for buying and selling used, old, or damaged items. By connecting you with buyers and sellers in your local community, Recyclify helps you reduce waste and give new life to items that might have otherwise ended up in the landfill.","imageSrc":"https://public-files.gumroad.com/qgcr6qffgh6hbnu39kg77fcmzef4","url":"https://github.com/AndreasOA/Recyclify"},{"id":"4","title":"CS:GO Market Bot","description":"In the world of Counter Strike Global Offensive, virtual skins are a valuable commodity. Keeping track of prices and trends across multiple marketplaces is key to make profit in this economic system. That's why I developed a unique script that offers a solution for players and collectors looking to monitor these virtual assets with ease. By integrating the most popular skin trading platforms, my script allows users to stay up-to-date on the latest prices, trends, and deals for their favorite skins. With real-time updates and customizable notifications, you'll never miss out on a great deal again.","imageSrc":"https://elements-cover-images-0.imgix.net/0191f239-e02f-4af8-afda-3025b715f997?auto=compress%2Cformat&fit=max&w=1170&s=2c2dba35dbf3b5d0253f6d5bd78787b5","url":""}],"services":[],"aboutpara":"My name is Andreas Oberdammer. \nI am 23 years old and currently reside in Weißkirchen an der Traun, Austria. I am an Artificial Intelligence master's student in the Life Science department.  I spend most of my free time educating myself in various fields, from app development, AI and data science projects, Kaggle challenges to designing and printing 3D models. Outside the digital world, I enjoy exploring nature with my racing bike or camera.","resume":{"tagline":"👋  I'm a Artificial Intelligence Master Student and developer.","description":"As a software developer, I have created websites, multiple AI applications and one mobile app. I specialize in Python programming and have used it extensively in my work. I also have a strong interest in photography.","experiences":[{"id":"1","dates":"October 2019 - November 2022","type":"Part Time","position":"Working Student","bullets":"Software development with python;Automation of a project verification pipeline "},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"December 2018 - September 2019","type":"Full Time","position":"Tooling Engineer","bullets":"Created a Webtool for project management with backend connection to JIRA;Worked on a measurement automation project in Matlab"},{"id":"4747077f-4408-4ed8-a16a-1bd171ce3b70","dates":"July 2017 - September 2018","type":"Part Time","position":"Internship","bullets":"School-finishing Thesis: Emergency Braking Assistant;Project and time management;Firmware Development in Python;Creation of basic operating system applications;Development of a graphical user interface"}],"education":{"id":"","universityName":"Johannes Kepler University","universityDate":"2023 - ?","universityPara":"Master of Science in Artificial Intelligence. Specialisation in Life Science","universityName2":"Johannes Kepler University","universityDate2":"2020 - 2022","universityPara2":"Bachelor of Science in Artificial Intelligence","universityName3":"Johannes Kepler University","universityDate3":"2019 - 2020","universityDate4":"2013 - 2018","universityName4":"HTL Wels - Electronics","universityPara3":"Switched from Electronics to Artificial Intelligence after one semester"},"languages":["Python","Java","Javascript","R","SQL","HTML5","CSS"],"frameworks":["React","Typescript"],"others":["Adobe Lightroom","Adobe Photoshop","Figma","Microsoft Excel, Word, Powerpoint, Outlook and Access","Jira"]}}